; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 11308)
	(= (fuel plane1) 3727)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 19)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 8)
	(at plane2 city2)
	(= (capacity plane2) 2424)
	(= (fuel plane2) 764)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 3)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 6)
	(at plane3 city2)
	(= (capacity plane3) 4246)
	(= (fuel plane3) 1943)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 6)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 2)
	(at person1 city0)
	(at person2 city1)
	(at person3 city2)
	(at person4 city0)
	(at person5 city3)
	(at person6 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 937)
	(= (distance city0 city2) 730)
	(= (distance city0 city3) 878)
	(= (distance city1 city0) 937)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 631)
	(= (distance city1 city3) 783)
	(= (distance city2 city0) 730)
	(= (distance city2 city1) 631)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 689)
	(= (distance city3 city0) 878)
	(= (distance city3 city1) 783)
	(= (distance city3 city2) 689)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city0)
	(at person2 city0)
	(at person4 city2)
	(at person5 city1)
	(at person6 city3)
	))

(:metric minimize (+ (* 3 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (fly plane2 city2 city0)
   deleted: (at plane2 city2)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 0 to 730, (fuel plane2) from 764 to 34
   goals met: 1 of 5
2. (refuel plane1 city1)
   changed: (fuel plane1) from 3727 to 11308
   goals met: 1 of 5
3. (fly plane3 city2 city1)
   deleted: (at plane3 city2)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 730 to 1992, (fuel plane3) from 1943 to 681
   goals met: 1 of 5
4. (board person6 plane1 city1)
   deleted: (at person6 city1)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 5
5. (board person2 plane1 city1)
   deleted: (at person2 city1)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 1 of 5
6. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 1992 to 6677, (fuel plane1) from 11308 to 6623
   goals met: 1 of 5
7. (debark person2 plane1 city0)
   deleted: (in person2 plane1)
   added: (at person2 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 2 of 5
8. (board person4 plane1 city0)
   deleted: (at person4 city0)
   added: (in person4 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 5
9. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 6677 to 11067, (fuel plane1) from 6623 to 2233
   goals met: 2 of 5
10. (debark person6 plane1 city3)
   deleted: (in person6 plane1)
   added: (at person6 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 3 of 5
11. (board person5 plane1 city3)
   deleted: (at person5 city3)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 5
12. (refuel plane1 city3)
   changed: (fuel plane1) from 2233 to 11308
   goals met: 3 of 5
13. (fly plane1 city3 city2)
   deleted: (at plane1 city3)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 11067 to 14512, (fuel plane1) from 11308 to 7863
   goals met: 3 of 5
14. (debark person4 plane1 city2)
   deleted: (in person4 plane1)
   added: (at person4 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 4 of 5
15. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 14512 to 17667, (fuel plane1) from 7863 to 4708
   goals met: 4 of 5
16. (debark person5 plane1 city1)
   deleted: (in person5 plane1)
   added: (at person5 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 5 of 5
